"""
平行与垂直的三维筮法

月日动行走路线和切点的最高法则。

动包括了动变延暗伏。

令神能量释放路线：

平台：
动变爻位、动延爻位。平台上位爻谓之上用，平台下位爻谓之下用。

还有两种爻位都有的像，比如说：巳化戌，入墓，是动变，但是还有生戌，是化延。

单个爻的位置上下分上下用。

穿越：
月日只有在穿越平台的情况下，才可对下用使权。

亥化申逢戌日，戌日是否能穿越？能，但是变成水了。


令神：
月日动变延暗伏7令神。令神的生克合冲切点=能量释放路线；
静爻有能量无切点
月日入卦并与临。

临：一般是静爻临日月，一般称之为月爻或者日爻。
并：并入动位（包含其他4个令神），对上用依然可以按照自己（申日，申令，卯在上，它依然可以克），对下用要按照动位的权力，而不是日的权力。


令神能量转化切点


平行筮法

平行筮法：主要是在平台，也就是动和变、动和延的平行。涉及到日月对平台的作用的处理。平台是平行筮法的核心。


三维思维：上下、左右、前后，再加上时间。

动化生：

如亥化申，逢土令生申传亥。逢寅令、巳令，会有贪合不冲的旺衰规律，但是核心还是看是主用神还是辅助用神。
时间上，如果先冲后合，可能有转机。如果是先冲，后面合，可能有转机。如果是先合，后冲，可能不行了。
如果午火，克；如果金水生之并之。

动化延：

动化生一般没有僭越，如果是动化生延，则

月日冲合平台：
比如亥化申，逢巳日，亥水如果是用神或元神，一定要会冲，如果申金是闲神，合与不合都没有关系。如果亥水不是元神或元神，申金是，那么申金合，对亥水影响不大，也就是弹合忘冲。

合与冲是平行的，没有谁先谁后，只有谁是用神，我们用哪个。

月日生克平台：一般是以传生论。亥化申逢戌日，申化亥逢戌日，贪生旺克。但如果是申化亥，如果是两个戌土，戌月戌日，此时有一个戌土克亥水。但是不知道是月还是日。

月日生克合冲平台：没讲


垂直筮法：

纳阻截通释
垂直与远近理论：上爻最近
穿越阻隔：
截煞与死位：

"""


class Power:
    pass


class LingPower:
    pass


class PlatformPower:
    pass


class DiZhiPower:
    pass
